CSI API ETABS v1
cLoadCases.GetTypeOAPI_1 Method
 Retrieves the case type, design type, and auto flag for the specified load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI_1(
	string Name,
	ref eLoadCaseType CaseType,
	ref int SubType,
	ref eLoadPatternType DesignType,
	ref int DesignTypeOption,
	ref int Auto
)
Function GetTypeOAPI_1 (
	Name As String,
	ByRef CaseType As eLoadCaseType,
	ByRef SubType As Integer,
	ByRef DesignType As eLoadPatternType,
	ByRef DesignTypeOption As Integer,
	ByRef Auto As Integer
) As Integer
Dim instance As cLoadCases
Dim Name As String
Dim CaseType As eLoadCaseType
Dim SubType As Integer
Dim DesignType As eLoadPatternType
Dim DesignTypeOption As Integer
Dim Auto As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI_1(Name,
	CaseType, SubType, DesignType, DesignTypeOption,
	Auto)
int GetTypeOAPI_1(
	String^ Name,
	eLoadCaseType% CaseType,
	int% SubType,
	eLoadPatternType% DesignType,
	int% DesignTypeOption,
	int% Auto
)
abstract GetTypeOAPI_1 :
        Name : string *
        CaseType : eLoadCaseType byref *
        SubType : int byref *
        DesignType : eLoadPatternType byref *
        DesignTypeOption : int byref *
        Auto : int byref -> int
Parameters
Name
Type: System.String
 The name of an existing load case
CaseType
Type: ETABSv1.eLoadCaseType
 This is one of the items in the eLoadCaseType enumeration
SubType
Type: System.Int32
 This is an integer representing the load case sub type. This item applies only for certain case types.
For NonlinearStatic
Nonlinear
Nonlinear staged construction
For Modal
Eigen
Ritz
For LinearHistory
Transient
Periodic
DesignType
Type: ETABSv1.eLoadPatternType
 This is one of the items in the eLoadPatternType enumeration
DesignTypeOption
Type: System.Int32
 This is one of the following options for the DesignType item
0 = Program determined
1 = User specified
Auto
Type: System.Int32
 This is one of the following values indicating if the load case has been automatically created
0 = Not automatically created
1 = Automatically created
Return Value
Type: Int32
 Returns zero if the type is successfully retrieved; otherwise it returns nonzero
Remarks
 This function supersedes GetTypeOAPI(String, eLoadCaseType, Int32)
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace